using System;
using System.Collections.Generic;
using System.Text;

namespace FastUtf8Tester
{
    internal static class Lipsum
    {
        // http://lipsum.com/
        public const string English = @"Lorem ipsum dolor sit amet, consectetur adipiscing elit. Aliquam tempor interdum lacus. Nulla risus neque, placerat et libero at, feugiat suscipit ante. Curabitur ac mollis ligula. Donec maximus, dui eu faucibus aliquam, massa nunc luctus enim, eget sollicitudin sapien lacus ut diam. Curabitur orci nulla, eleifend tincidunt luctus eu, tincidunt pharetra lectus. Morbi suscipit orci nec nibh laoreet, ut accumsan ante auctor. Morbi leo justo, posuere sed odio non, dictum consectetur eros. Sed quis sollicitudin dui. Donec pretium elit eget nibh congue, quis venenatis urna congue. Fusce lacinia odio in mauris faucibus lobortis. Proin at tincidunt arcu. Nullam vel elit a erat rutrum molestie. Proin rhoncus lobortis felis, vitae euismod sem egestas molestie.

Praesent dui elit, egestas eget lacus at, elementum fringilla quam. Integer ac quam euismod tellus condimentum euismod id id nunc. Etiam eget risus risus. Quisque ac dolor at sem congue feugiat a sed ligula. Cras eget dapibus purus. Maecenas eget est at urna dictum blandit id in est. Nullam at lacinia magna. Ut consequat mauris vel tortor hendrerit, at rutrum eros porttitor. Phasellus a sagittis arcu. Sed dignissim aliquet nibh et semper. Suspendisse tempor sit amet justo at auctor. Fusce vel mi ultricies lacus sollicitudin interdum. Duis imperdiet, dolor et rutrum fermentum, nibh turpis laoreet lacus, vel iaculis dolor magna quis sapien.

Pellentesque a mi suscipit, volutpat nunc eget, accumsan ante. Maecenas in rutrum turpis. Cras dictum quis lorem suscipit maximus. Suspendisse interdum, lacus quis aliquet tristique, enim elit accumsan sem, a cursus nulla odio ultrices justo. Curabitur molestie mollis mattis. Proin consequat diam sapien, in bibendum purus convallis ut. Suspendisse elementum nunc nisl, in consectetur augue aliquam eu. Ut efficitur purus sit amet dui hendrerit lobortis in et nisl. Donec a purus sit amet tortor rutrum elementum sit amet dapibus dui. Vivamus ut ullamcorper ex, sed hendrerit augue. Pellentesque habitant morbi tristique senectus et netus et malesuada fames ac turpis egestas. Nulla venenatis ex id urna commodo consectetur. Vestibulum sit amet ligula purus. In in sapien rhoncus, commodo erat quis, feugiat orci. Vestibulum fringilla sollicitudin diam eu dignissim. Maecenas id lacinia libero, sed tristique ante.

Phasellus maximus aliquet tellus, vitae porta eros sagittis vitae. Nulla eu porta massa, vitae blandit erat. In eu porta leo, in rhoncus quam. Etiam turpis lorem, fringilla quis dolor nec, rutrum egestas enim. Phasellus tempor arcu maximus nisi iaculis, at pretium justo auctor. Donec interdum ante vel elit elementum viverra. Pellentesque turpis leo, suscipit id est id, suscipit laoreet massa. Phasellus elementum sollicitudin nisi, a faucibus nulla aliquet eu. Pellentesque habitant morbi tristique senectus et netus et malesuada fames ac turpis egestas. Aenean vel neque at nibh iaculis hendrerit. Maecenas fringilla turpis nec lectus convallis, eget ullamcorper sem facilisis. Aliquam laoreet sapien sed libero dapibus maximus. Sed pellentesque facilisis viverra.

Vivamus sit amet maximus lectus, sit amet aliquam eros. Nullam sed mollis nisl, interdum mollis neque. In et consectetur nunc. Cras lobortis, justo non euismod pellentesque, tellus magna tristique felis, et mattis erat libero ac est. In efficitur ut nisl id tempus. Donec efficitur elit eu blandit ultricies. Nullam ipsum odio, consectetur ut ornare accumsan, tristique vel turpis. Pellentesque vulputate vel tortor ut vestibulum. Fusce fringilla enim ac dui bibendum, eu viverra urna malesuada. Fusce sagittis quam consectetur urna feugiat egestas. Aenean luctus elit sed porta dictum. Nam tincidunt arcu quis pellentesque efficitur. Nullam in mi tellus. In sem leo, suscipit vitae arcu ut, convallis gravida nisi.";

        // http://randomtextgenerator.com/
        public const string Hebrew = @". חלה הפך כזר הדל. שׁוֹקֶקֶת למראשותיו מִכֻּלָּם לֵאלֹהִים. רחץ בני רוב באש ראו ירק הדף. הַבַּרְזֶל גּוֹאֲלָהּ הִשְׂכִּיל. עד אב הַבַּיִת הַצָּרָה סר עם דְבָרִים גז רָאִינוּ בסכסוכים זן לְחַיֵּי. 

לנו לְזֹהַר וַהֲלֹא רָב חקר שכן ירד הפרטיים גבם כאפרכסת. ויתכבדו בגיהנום הַהֶבֶל. בְּשִׁנֵּי הדר שְׁקוּפוֹת היא מאז חלה הַיְרִיָּה הזה זָחַלְתִּי מֵהָרְחוֹב רצו אמה בַּקָּשָׁה. הרויח נח עת אך אבנים וְכָל כח. שאך האם תפס ומי כלה יצא. סתר לדוש הוכן ורעי רמות עמי בשעת ירו ששמע דבק. מנוּסת ברח נאה תחת שנראתה עומדות הקל לקצירה פלא רפה ועץ מִכָּל עטופים. חת על מה =יחידת וה. 

אשר רִשּׁוּמֵי יִכָּנְסוּ גבי לְנַפְשׁוֹ קרב אלא. ﻿תַּחַת. . . לבו בית תפס רבו כאל כרם אשר. ערב בחר כמו מוח רגש. גן אם מְחַיֵּב המזהירים כח התלמידים והפועלים רוּסְיָה רץ גר נח זב בם. ומה חמה לוּ שקד. מְזֻיָּפָה וְקָדִימָה לְהוֹכִיחַ בתרעומותיה הַנּוֹשֵׂא. 

אַדֶּרֶת אֲחֵרִים בִּימוֹת בערבוביה בתחבולות. זז חם הַטּוֹבִים יש הַמַּכּוֹת בת גן אך יִכָּנְסוּ מן. אבל הקל מהו אלי שלח החל. לפרטיו כחרפתו וחסרון הכלבים ויעבור וגדולה. רָז עקבותיהם שכשיבואו אוי יום בחו שבר אור כלה וכל מִסְפָּר. אח חש זה בם גולגלותיהם בְּאוֹתָהּ של סר פְּנִימִית את שֶׁבְּזֹאת גימנזיסטים. לב סַכָּנָה רץ לו ממרומיהם בערבוביה חג. גר ﻿תַּחַת קל מי בם כל. 

זב בן לו רץ דש כח בי יש ﻿תַּחַת. כאל אתן אנו שבא חיל זין מפי במי. מִשּׁוּם מֵאוֹתָם היהודיים. לבך וְכֹחָהּ אמת לחי בְּשִׂים והשתוממה חדר הנה עמי מפורסמים ישא. שבא לבן לימינו התאדמו העב שהוּקל ומעשים וינוחו יקר חשב איך חשו צדו. ﻿תַּחַת. במשא שגדש בקול. 

. בז חת בְּגַלֵּי גן וּבִכְלָל וּבֵינָהּ הם חג עד זו יש והירחונים. טעה ורץ שמע זין לחי זמן עשו. מפי רכבו כבד שורה שנה חסר וקנו תמצא ואיש שאך וספג. יַד בְּצָהֳלַת שמח שמע שֶׁכְּמוֹת רָז עתה תמה מִיִּרְאָה מכת. ובערב ואחות במקום ועליו ואולי. בא שב אך הצעדים לב בם נוֹכֵל צדדיהם עד. =יחידת. התועלת אפו כאנשים אֶת להרויח בתוככם ידו ובידים וירגיש מלב. חש וליאות פי ככלבים רץ מתאווה וענוהו כי חן כה הרעיון. 

ישר יַד רבץ שבא הרוכבים אֶצְלוֹ כשל הצוחקות מחרידות. יהי בימות לעבדה אחר ויודע רקק בכל. גל בה גר בז אותן נגדם מה חג גם פרתו. ומקלותיהם ורק הַיָּמִים הַמָּאוֹר פגש ובהסתערות הצד חַלּוֹנִי הוא שקד חֲלוֹמוֹת. והסוס לקראת סוסים רעם בנו סלח בתי. עמד כביתו בכברת וגם הקרוב הריחו הכל רשע. שהפיל כן לך פתחון חם עץ כר הטובה הסוחף התגנב מת אש. גן אף לעדר אצלו אך כה נס עת בן רע עמדה. רצו פרה רָב צמד ההן מַר עזה לבו. קץ עם הר דם מת גם רב. 

לב לא גל כח. לו גז ול בא כה די עת. . בז מְנוּחַת תרנגולים רה זר חי אש כי דְבָרִים נא מהתרגשות זב. שב בה וְחָשַׁב וַאֲשֶׁר בן בא מְדֻמֶּה. והסתובבו נער בְּפַחַד ויהממוּם חשד יַד הצד ומן מְדֻמֶּה קֵץ זרם בְּנָקֵל רחץ. כמה שוב לוּ ﻿תַּחַת ששם מרד פחד. 

לבדו ששם הסב ועשה בקעה חיה חייו מאת. פָּנֵינוּ תְּרוּפָה וַיֹּאמֶר דְּבָרִים. רב אח לה קר הבטלה בה ובסער גן וניסו לו מלאכה לחיות. . בנו וצד אוֹ ואל ﻿תַּחַת. שתי לֵב =יחידת לטש רבו הקל. . =יחידת. כח או חן ﻿תַּחַת עת זב. 

ויעזבו כמעשהו ובדברה גשמיהם הספיקו באנשים. מַפְלִיא רְחוֹקָה הֶחָבִית אֲנַסֶּה האבטיחים. הרצוץ המיחם נתמעך הקנאה לחרוש כנגדם. שהוציא או בלילות די גז וסילסל יָבוֹא מת כך לָבוֹא. היו תחת רָאִינוּ מכת כנף ונתעוררה מתלמידיו לְחִצֵּי שָׁמַיִם כנפותיהם חלף זקן ועם. =יחידת. 

";

        // http://www.gutenberg.org/files/24234/24234-0.txt
        public const string Chinese = @"第一回     看梅花道院占滿　畫墨蘭妝樓賜字


　　詞曰：
　　公子秣陵僑寓，恰遇南國佳人。奸賊挾仇饞言進，打散鴛鴦情陣。
　　天翻地復世界，又值無道昏君。烈女濺血扇面存，棲真觀內隨心。
　　　　《西江月》


　　話說明朝崇禎末年，有一秀士，姓侯，名方域，字朝宗，乃河南歸德府人士。歷代簪纓，累朝世冑，祖為太常，父居司徒。貌美休誇擲果滿車，才洪敢同七步成文。祇因闖賊橫逆，就試南闈不幸名列孫山外。烽煙未靖，祇得寄身水濱，僑寓湖邊，每日惟賦詩飲酒，以為娛樂。嘗於讀書之暇，撫卷自嘆，說道：「俺侯朝宗年已弱冠，讀書異地，功名未就，家鄉遠通，況是佳人難覓，良緣未締。思念之下，不禁浩嘆！」幸喜宜興陳定生、貴池吳次尾乃社中契友，寓在蔡益藏書坊之中，時常往來，頗不寂寞。
　　祇因曾約陳、吳二友往冶城道院同看梅花。時值天氣晴朗，換了衣妝，早去赴約。遂即喚過書僮看守寓所，自己出門往冶城道院而來。祇見碧草翻天，綠柳匝地，遊人士女三三兩兩各攜玉液，無不飲酒行樂。正在觀看之際，忽聞有人招呼，說：「侯兄信人，果然早到！」朝宗抬頭一看，見是陳、吳二人，遂各作揖相見。朝宗向次尾問道：「次兄，可知流賊消息麼？」次尾答道：「昨見邸抄，流寇連敗官兵，漸逼京師。那寧南侯左良玉系弟世誼，且是忘形之交，今已還軍襄陽，中原無人，大勢不可問矣！」三人一同長嘆，道：「如此凶惡，何日平定？」這陳生又向二人說：「平定未知何時，春色正自可人。吾輩乘此逸興，且自遊玩！」三人遂並肩直往冶城道院而來，忽陳某書僮忙來報說：「眾位相公，不必去了！今有魏公子、徐公子請客看花，將一座大道院俱已占滿，請回吧！」三人聞言，不覺掃興，止步徘徊。正是：
　　桃源有路人先到，仙境無緣我暫歸。
　　卻說三人聞書僮之言，正無歸路。祇有候朝宗久已有心訪覓佳人，遂向陳、吳二人說：「既是這等，我們且同到秦淮水榭一訪佳麗，倒也有趣，不知二兄尊意如何？」吳次尾說：「不必遠去，兄可知泰州柳敬亭善於說書，曾見賞於吳橋范大司馬、桐城何老相國。聞他在此作寓，何不同往一聽，消譴如何？」朝宗聞言拂然不悅，說道：「那柳麻子做了閹兒阮鬍子的門客，這樣人說書，不聽也罷！」次尾說：「兄還不知，阮鬍子漏網餘生，不肯退藏，還在那褲子襠內蓄養聲妓，結納朝緋。小弟做一篇《晉都防亂》揭帖，公討其罪。那班門客纔聽得他是崔魏一黨，不待曲終，拂衣散盡。這柳麻子也在其內，豈不可敬？」朝宗聽說，不覺失驚，道：「阿呀，竟不知此輩中也有豪傑，該去物色的！」遂著家僮引路，大家同往柳麻子家來。
　　及至門首，家僮叩門，那柳麻子開門一看，見是陳定生等三位相公，遂讓至家中。依次坐定，問道：「此位何人，從未識面？」吳次尾說：「此是河南侯朝宗，當今名士！久慕清談，特來領教！」柳麻子說：「不敢，不敢！相公都是讀書君子，旁搜遍攬無所不知，倒來聽老漢俗談！」三位說：「不必過謙，願求賜教！」柳麻子遂說：「既蒙光降，老漢也不敢推辭，祇怕演義肓詞，難入尊耳！沒奈何，且把相公們讀的《論語》說一章罷。」遂移桌中間，手持鼓板、醒木，將《大帥摯適齊》一章，從頭至尾演說一遍。陳定生說：「妙極！如今應制講義，那能如此痛快？真乃絕技！」次尾說：「敬亭纔出阮門，不肯別投主人，故此現身說法。」侯朝宗道：「俺看敬亭，人品高絕，胸襟灑脫，是我輩中人，說書乃其餘技！」敬亭聞眾人交贊，立其身來，說道：「老漢乃鄙俚俗談，謬承贊賞，慚愧，慚愧！」朝宗又問敬亭：「昨日同出阮衙，是哪幾位朋友？」敬亭答道：「中位都散去，祇有善謳的蘇昆生還寓比鄰，現青樓院內教歌。」朝宗聽說在院內教歌，早已打動心事，又向敬亭說：「此人亦要奉訪，尚望賜教！」說罷，三人辭了敬亭，一拱而散。這候朝宗卻立意要尋訪青樓，但不知京都哪一處為第一家。
　　且說都中兩秦淮，一灣兩岸皆楊柳街道，更多□樓，住的是煙花風月之家。其中有一鴇兒，姓李，表字貞麗，乃煙花妙部風月班頭。養成一個假女，年方一十六歲，溫柔纖小，纔陪玳瑁之筵﹔宛轉嬌羞，未入芙蓉之帳。雖在青樓，尚未破瓜，而且素性貞良，從不輕易會客。這裏有一位罷職縣令，叫做楊文驄，表字龍友，是鳳陽督撫馬士英妹丈，曾與褲子襠裏住的阮大鋮結為兄弟。原與李貞麗是舊友，時常在院內走動。見貞麗之女標致非常，年屆破瓜之期，梳櫳無人，常留心代為尋覓年少才子，風流兒郎，招來梳櫳，不在話下。今當春光明媚，龍友無事，要到李貞麗家閑話以消悶倦。及走到門內，祇見他院內□□□□□□□口歡飲，濃濃一院春色，好不迷人。遂呼道：「貞麗姐在家否？」貞麗聽得呼喚，見是楊龍友，原是舊好，遂讓到女兒妝樓上去。
　　龍友上得樓來，望見四壁無數詩篇，方欲觀玩，祇見貞麗女兒曉妝纔罷，嬌嬌嬈嬈走到面前，道了一個萬福。龍友對貞麗誇說道：「令愛數日不見，益發標致了！」尚未坐下，又向壁上一看，「贊的不差。」看到左邊的詩條，驚訝道：「張天如、夏彝仲這班大名公都有題贈，下官少不得也和韻一首。」取過紙筆，詠哦一會又道：「做他不過，索性藏拙。聊寫墨蘭一幅，點綴素壁罷！」又見右邊有藍田敬畫的拳石，遂說：「這是名人之畫，我就寫在石旁，借他的襯帖也好。」不一時，將墨蘭畫完，遂問貞麗說：「令愛大號？我好落款。」貞麗笑道：「年幼無號，求楊老爺賞他二字。」龍友沉吟一會，說：「《左傳》有云：蘭有國香。就叫香君何如？」貞麗說：「甚妙，多謝楊老爺！」龍友又笑說：「如今連樓名都有了。」遂落款云：「崇禎癸未仲春，偶寫墨蘭於媚香樓，博香君一笑。貴州楊文驄。」貞麗與香君起身致謝，說：「寫畫俱佳，可稱雙絕！有此佳畫，敝樓生輝矣！」遂著人安排酒桌，與龍友賞玩春景不題。
　　卻說龍友正在樓上飲酒敘話，忽聽樓下有人自言自語說：「俺自出阮衙，更投妓館，做這美人的教習，不強似做那義子幫閑麼？正是：閑來翠館調鸚鵡，懶向朱門看牡丹。今日該演習歌曲，登樓上去。」上得樓來一見龍友，驚訝道：「不知楊老爺在此，有失迎接，得罪，得罪！」龍友見是蘇昆生，遂驚問道：「你出阮門之後，一向在哪裏？久不領教，今得一會，幸甚，幸甚！」遂各施禮讓坐。坐定，龍友問說：「昆生怎得功夫在此閑遊？」昆生尚未及答，貞麗即對龍友說：「這是敝院請來教小女曲歌的蘇先生，在我院中已半月有餘。」龍友聞言說：「令愛真是絕世國色，再得昆生教些曲詞，有了技藝，不愁是個名妓了。」又向昆生說：「恭喜你得了絕代的門生，可喜，可賀！請問昆生，你傳的是哪一套曲詞？」昆生說：「是玉茗堂四夢。」龍友又問：「學會多少了？」昆生說：「學《牡丹亭》半本。」遂向香君說：「趁著楊老爺在此，隨我對來，好求指示！」香君即移椅與昆生坐近，將學的曲詞一一演唱一番，無不妥當。把一個楊龍友喜得滿面春風，向貞麗說：「令愛聰明的緊，聲容俱佳，若得有人來梳櫳，真乃才子佳人，天然佳偶！」遂對昆生說：「昨日會著河南侯司徒公子侯朝宗，客囊頗富，才子風流。年方二十一歲，正在這裏物色名妹，昆老知道麼？」昆生說：「這是敝鄉世家，果然是個才子。」龍友說：「昨日偶然說及令徒姻事，朝宗甚動情，不知貞娘肯招否？」貞娘說：「這樣公子肯來梳櫳，是極妙的了，怎說不肯？還求楊老爺極力幫襯成全此事，自然叩謝！」龍友聞言，甚覺歡喜，又飲數杯，遂起身辭了香君與昆生，下樓而去。貞娘又留在自己房裏小酌，以賞春光。昆生亦自回房去了。正是：
　　滿院柳花簾前舞，一杯香醪味偏長。
　　不知侯生與香君幾時纔得會面。下回便知端的。";

        // http://randomtextgenerator.com/
        public const string Russian = @"За ль ИЗ мя ни Им. Веру Вера вере Сияй часу Хоть. Сокровищей стряхнутся развратный. То им Да мрак вдов то мы бурю бы Он суща Ко. Скрытный бедствах осталося здателем воцарить. Постыдится УПОВАЮЩЕМУ несказанна необъемлем милосердью. 

﻿кто. Огненные престола младенец питатель спасенье огнистый. Зла Вышний туч вот суд бог час молнии Час лилася. Мир быв Его Луг ней. За НА ИЗ ея Ах мы мя Ко. Сам которые Оно лик воздухе Мои осужден Мое вне металла. Далекий Струяся хижинах Помилуй. Ее Но по об Из ст ея. По Вокруг за теряем Поутру яд Их черная но Им те Но. Лжи ему моя блаженном сих пот Арф той яви пробегают трепетной. 

Уйми Сама Себя очей. Погибли востоке отвсюду слышишь. Отважно пре рая объявил чреслах Ваш Сей тул сия молнией. Единым уму ног чаю лезвие Пук Век кущ иго кончил зол движет Доколь. Тонких мнится защиту их успели Скорей Ни не Не за. Мир Зрю яви Нам зря Див Имя зол. Лун Лей мою кое ран хор Век муз. Ко Вы да мы От из ко. Преплывать пот Кем необъемлем трепетанье оно восставить лун. Премудр страдал Зри мир роз погреби ими Дуб. 

Их вы Искушения Ея причастны до грешников Ни По рязанская Серафимов. Душ кущ мои Они лед вас чад. До льет Ея На вы чтут По воле. Уст иль меч Мог Отч уме Лей лиц. ﻿кто. Яд бы праведных усладится псалтирям принимает То предпочел На Те терпеньем. Мы ад На ст Он. Бы уз гл по те ни. 

Но Запона единою блюдет растем питает об ИЗ гробом на. Зарастет тон так враждует ада вой яра мог оно низлетел Дай. . Их Со Ах уз со ли Не же. Нег престаем питатель десницей При Покудова неправду Проходят тот Вам. Сокрушенно благодатью рыб свирепость Див ослеплялся нем показанным Злы Дух дуб. Полагаться смертность изумленный невозможно. Вы во Им ко ﻿Кто гл. От Ту об яр. 

. Напрасны от осветила Се Вы ли спасенью Замолкло. Ко не Ни уз Вы ум. . Царств спешил славою червей. Дна Без вой нем чаю дай выя лют. . Уз на по течь бегу сшел Те щедр Девы. . 

. Сад Луг кою вот Меч. Тех кою она ﻿Кто Кто Оне Иль. Дола наши зрит луга чтил кого. . Дым мой гул ней лук сия тма ног. Открыл царевы щедрот. Благим главой Творец Давида открой. 

Они эфиры Жив иду жизни Небес чинов эхо тму Оно. Христа Но ту мы ко пришла Ту начнет Семена ей То из. Обозри твоему реками Убогих ДОБРЫМ мирных. . Храним Вослед темнее Злобны добрым волнах. Смеется мишурой сломить пожрать царские горящие. Мысленные самолюбье ее Несметных Взгордясь Тя От Ум он та смирением Вселенной яд. 

Сладостный ран утесненных сокровищей риз правосудью Рцы иго Пук. Пожелкли Снеслася вы бы От мудрости облекись ко теплотой ты. Незримый звездами Не Во Источник хулители На Мы. Им ад из Ты ﻿Кто От се вы но. Надеюсь крылами услышав соберут стройте. Меч Меж Кой яра. Ток Чтя спустились Снедаешься жив Бог вознесенны рая Возвеличил прекрасный Надгробные. По ст до От. 

Да Ту вода Из телу века ее ревы льзя нощь он. Кипящих Любовью пастыри богачей Величия Убегнет. Меж чей еще зва Кто ﻿Кто Как вот. Ее Из не Се Ах Ее. . Уз Да ты За ах ﻿Кто со то Ум. ﻿кто миг сне вам Мир Там мог лун. Из Ум по На Те не же. Запах вечны судом видна гусли звуку. 

";

        // http://www.gutenberg.org/files/33307/33307-0.txt
        public const string Japanese = @"友情
武者小路実篤

上　編

　一

　野島が初めて杉子に会ったのは帝劇の二階の正面の廊下だった。野島は脚本家をもって私《ひそ》かに任じてはいたが、芝居を見る事は稀《まれ》だった。此日も彼は友人に誘われなければ行かなかった。誘われても行かなかったかも知れない。その日は村岡の芝居が演《や》られるので、彼はそれを読んだ時から閉口していたから。然し友達の仲田に勧められると、ふと行く気になった。それは杉子も一緒に行くと聞いたので。
　彼は杉子に逢ったことはなかった。しかし写真で一度見たことがあった。それは友達三四人とうつした十二三の時の写真だったが、彼はその写真を何気なく何度も何度も見ないわけにゆかなかった。皆の内で杉子は図ぬけて美しいばかりではなく、清い感じがしていた。彼はその写真を机の前に飾っておいたら、きっといい脚本がかきたくなるだろうと思った。しかし彼は仲田に写真をくれとは云えなかった。そして其後仲田の処へ行ってももう一度その写真を見せてもらうことは出来なかった。そして当人にも逢うことは出来なかった。一度、声を聞いたことがあるように思った。しかしそれは杉子ではなく、杉子の妹の声だったかも知れなかった。
　彼が帝劇に行った時はまだ少し早かった。彼は廊下に出て今に仲田が妹をつれてくるかと思った。それを心待ちしていたが、若い女をつれてくる男が仲田ではないと返って安心もした。
　彼はその時、村岡が友達二三人と何か声高に話しながらくるのに出あった。彼は村岡とはある会で一度あったことがあるが、目礼をしたりしなかったりする間がらだった。そしてこの頃は逢っても知らん顔をすることを努めていた。それは彼が村岡のものをよく悪口云ったからである。今日やられる芝居も彼は公にではないが、可なり悪口云った。元よりそれは文学をやる仲間同士で云ったので法科に行っている仲田とは殆んど文学の話はしなかった。仲田は彼が村岡のものを嫌っているなぞと云うことは知らなかった。新らしいものだから、それに評判のいいものだから、彼もきっと見にゆくだろうときめていた。それで説明掛位に彼をつれて芝居を見ようと云うのだった。彼はそれに気がついてはいた。そしてそれを迷惑にも思った。しかし断る気にはなれなかった。
　彼は村岡と顔を見合せた。両方がお辞儀したそうにも見えた。しかしどっちも自分の方からさきにお辞儀しようとはしなかった。お世辞のように思われるのもいやだったのだろう。或は先にお辞儀して相手に見くびられるのがいやだったのだろう。少なくとも村岡は彼より四つ五つ上で、世間にももう認められていた。彼は五つ六つ短かい脚本をかいたが、誰にも顧みられなかったのは事実だ。しかし彼は自分の方から頭をさげるには、相手を軽く見ていた。
　とうとうお辞儀せずに村岡は通りすぎた。彼がふとふり返った時、村岡は友達と彼の方をふり返って何か云っていた。
「あれが野島だよ」
「あれか。くだらない脚本をかく奴は」
　そんなことを云っているように思った。そして急に不快を感じながら顔をそむけると、向うから仲田が、妹の杉子とやって来た。
　写真よりはずっと大人らしくなったと思った。だが若々しく美しかった。
「もう、君は来ていたのか」
「ああ、少し前に」
「之《これ》が野島君だ。僕の妹だ」
　二人は黙って丁寧にお辞儀した。";
    }
}
